7767517
166 176
Input            data                     0 1 data
Convolution      mobilenetv20_features_conv0_fwd 1 1 data mobilenetv20_features_conv0_fwd 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        mobilenetv20_features_batchnorm0_fwd 1 1 mobilenetv20_features_conv0_fwd mobilenetv20_features_batchnorm0_fwd 0=32
ReLU             mobilenetv20_features_relu0_fwd 1 1 mobilenetv20_features_batchnorm0_fwd mobilenetv20_features_relu0_fwd
Convolution      mobilenetv20_features_linearbottleneck0_conv0_fwd 1 1 mobilenetv20_features_relu0_fwd mobilenetv20_features_linearbottleneck0_conv0_fwd 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        mobilenetv20_features_linearbottleneck0_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck0_conv0_fwd mobilenetv20_features_linearbottleneck0_batchnorm0_fwd 0=32
ReLU             mobilenetv20_features_linearbottleneck0_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck0_batchnorm0_fwd mobilenetv20_features_linearbottleneck0_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck0_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck0_relu0_fwd mobilenetv20_features_linearbottleneck0_conv1_fwd 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        mobilenetv20_features_linearbottleneck0_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck0_conv1_fwd mobilenetv20_features_linearbottleneck0_batchnorm1_fwd 0=32
ReLU             mobilenetv20_features_linearbottleneck0_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck0_batchnorm1_fwd mobilenetv20_features_linearbottleneck0_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck0_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck0_relu1_fwd mobilenetv20_features_linearbottleneck0_conv2_fwd 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        mobilenetv20_features_linearbottleneck0_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck0_conv2_fwd mobilenetv20_features_linearbottleneck0_batchnorm2_fwd 0=16
Convolution      mobilenetv20_features_linearbottleneck1_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck0_batchnorm2_fwd mobilenetv20_features_linearbottleneck1_conv0_fwd 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        mobilenetv20_features_linearbottleneck1_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck1_conv0_fwd mobilenetv20_features_linearbottleneck1_batchnorm0_fwd 0=96
ReLU             mobilenetv20_features_linearbottleneck1_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck1_batchnorm0_fwd mobilenetv20_features_linearbottleneck1_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck1_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck1_relu0_fwd mobilenetv20_features_linearbottleneck1_conv1_fwd 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        mobilenetv20_features_linearbottleneck1_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck1_conv1_fwd mobilenetv20_features_linearbottleneck1_batchnorm1_fwd 0=96
ReLU             mobilenetv20_features_linearbottleneck1_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck1_batchnorm1_fwd mobilenetv20_features_linearbottleneck1_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck1_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck1_relu1_fwd mobilenetv20_features_linearbottleneck1_conv2_fwd 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        mobilenetv20_features_linearbottleneck1_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck1_conv2_fwd mobilenetv20_features_linearbottleneck1_batchnorm2_fwd 0=24
Split            splitncnn_0              1 2 mobilenetv20_features_linearbottleneck1_batchnorm2_fwd mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck2_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck2_conv0_fwd 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        mobilenetv20_features_linearbottleneck2_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck2_conv0_fwd mobilenetv20_features_linearbottleneck2_batchnorm0_fwd 0=144
ReLU             mobilenetv20_features_linearbottleneck2_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck2_batchnorm0_fwd mobilenetv20_features_linearbottleneck2_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck2_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck2_relu0_fwd mobilenetv20_features_linearbottleneck2_conv1_fwd 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        mobilenetv20_features_linearbottleneck2_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck2_conv1_fwd mobilenetv20_features_linearbottleneck2_batchnorm1_fwd 0=144
ReLU             mobilenetv20_features_linearbottleneck2_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck2_batchnorm1_fwd mobilenetv20_features_linearbottleneck2_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck2_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck2_relu1_fwd mobilenetv20_features_linearbottleneck2_conv2_fwd 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        mobilenetv20_features_linearbottleneck2_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck2_conv2_fwd mobilenetv20_features_linearbottleneck2_batchnorm2_fwd 0=24
BinaryOp         mobilenetv20_features_linearbottleneck2_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck2_batchnorm2_fwd mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck2_elemwise_add0 0=0
Convolution      mobilenetv20_features_linearbottleneck3_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck2_elemwise_add0 mobilenetv20_features_linearbottleneck3_conv0_fwd 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        mobilenetv20_features_linearbottleneck3_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck3_conv0_fwd mobilenetv20_features_linearbottleneck3_batchnorm0_fwd 0=144
ReLU             mobilenetv20_features_linearbottleneck3_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck3_batchnorm0_fwd mobilenetv20_features_linearbottleneck3_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck3_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck3_relu0_fwd mobilenetv20_features_linearbottleneck3_conv1_fwd 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        mobilenetv20_features_linearbottleneck3_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck3_conv1_fwd mobilenetv20_features_linearbottleneck3_batchnorm1_fwd 0=144
ReLU             mobilenetv20_features_linearbottleneck3_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck3_batchnorm1_fwd mobilenetv20_features_linearbottleneck3_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck3_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck3_relu1_fwd mobilenetv20_features_linearbottleneck3_conv2_fwd 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        mobilenetv20_features_linearbottleneck3_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck3_conv2_fwd mobilenetv20_features_linearbottleneck3_batchnorm2_fwd 0=32
Split            splitncnn_1              1 2 mobilenetv20_features_linearbottleneck3_batchnorm2_fwd mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck4_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck4_conv0_fwd 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        mobilenetv20_features_linearbottleneck4_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck4_conv0_fwd mobilenetv20_features_linearbottleneck4_batchnorm0_fwd 0=192
ReLU             mobilenetv20_features_linearbottleneck4_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck4_batchnorm0_fwd mobilenetv20_features_linearbottleneck4_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck4_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck4_relu0_fwd mobilenetv20_features_linearbottleneck4_conv1_fwd 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        mobilenetv20_features_linearbottleneck4_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck4_conv1_fwd mobilenetv20_features_linearbottleneck4_batchnorm1_fwd 0=192
ReLU             mobilenetv20_features_linearbottleneck4_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck4_batchnorm1_fwd mobilenetv20_features_linearbottleneck4_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck4_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck4_relu1_fwd mobilenetv20_features_linearbottleneck4_conv2_fwd 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        mobilenetv20_features_linearbottleneck4_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck4_conv2_fwd mobilenetv20_features_linearbottleneck4_batchnorm2_fwd 0=32
BinaryOp         mobilenetv20_features_linearbottleneck4_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck4_batchnorm2_fwd mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck4_elemwise_add0 0=0
Split            splitncnn_2              1 2 mobilenetv20_features_linearbottleneck4_elemwise_add0 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck5_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck5_conv0_fwd 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        mobilenetv20_features_linearbottleneck5_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck5_conv0_fwd mobilenetv20_features_linearbottleneck5_batchnorm0_fwd 0=192
ReLU             mobilenetv20_features_linearbottleneck5_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck5_batchnorm0_fwd mobilenetv20_features_linearbottleneck5_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck5_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck5_relu0_fwd mobilenetv20_features_linearbottleneck5_conv1_fwd 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        mobilenetv20_features_linearbottleneck5_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck5_conv1_fwd mobilenetv20_features_linearbottleneck5_batchnorm1_fwd 0=192
ReLU             mobilenetv20_features_linearbottleneck5_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck5_batchnorm1_fwd mobilenetv20_features_linearbottleneck5_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck5_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck5_relu1_fwd mobilenetv20_features_linearbottleneck5_conv2_fwd 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        mobilenetv20_features_linearbottleneck5_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck5_conv2_fwd mobilenetv20_features_linearbottleneck5_batchnorm2_fwd 0=32
BinaryOp         mobilenetv20_features_linearbottleneck5_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck5_batchnorm2_fwd mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck5_elemwise_add0 0=0
Convolution      mobilenetv20_features_linearbottleneck6_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck5_elemwise_add0 mobilenetv20_features_linearbottleneck6_conv0_fwd 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        mobilenetv20_features_linearbottleneck6_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck6_conv0_fwd mobilenetv20_features_linearbottleneck6_batchnorm0_fwd 0=192
ReLU             mobilenetv20_features_linearbottleneck6_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck6_batchnorm0_fwd mobilenetv20_features_linearbottleneck6_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck6_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck6_relu0_fwd mobilenetv20_features_linearbottleneck6_conv1_fwd 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        mobilenetv20_features_linearbottleneck6_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck6_conv1_fwd mobilenetv20_features_linearbottleneck6_batchnorm1_fwd 0=192
ReLU             mobilenetv20_features_linearbottleneck6_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck6_batchnorm1_fwd mobilenetv20_features_linearbottleneck6_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck6_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck6_relu1_fwd mobilenetv20_features_linearbottleneck6_conv2_fwd 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        mobilenetv20_features_linearbottleneck6_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck6_conv2_fwd mobilenetv20_features_linearbottleneck6_batchnorm2_fwd 0=64
Split            splitncnn_3              1 2 mobilenetv20_features_linearbottleneck6_batchnorm2_fwd mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck7_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck7_conv0_fwd 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        mobilenetv20_features_linearbottleneck7_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck7_conv0_fwd mobilenetv20_features_linearbottleneck7_batchnorm0_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck7_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck7_batchnorm0_fwd mobilenetv20_features_linearbottleneck7_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck7_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck7_relu0_fwd mobilenetv20_features_linearbottleneck7_conv1_fwd 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        mobilenetv20_features_linearbottleneck7_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck7_conv1_fwd mobilenetv20_features_linearbottleneck7_batchnorm1_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck7_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck7_batchnorm1_fwd mobilenetv20_features_linearbottleneck7_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck7_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck7_relu1_fwd mobilenetv20_features_linearbottleneck7_conv2_fwd 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        mobilenetv20_features_linearbottleneck7_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck7_conv2_fwd mobilenetv20_features_linearbottleneck7_batchnorm2_fwd 0=64
BinaryOp         mobilenetv20_features_linearbottleneck7_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck7_batchnorm2_fwd mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck7_elemwise_add0 0=0
Split            splitncnn_4              1 2 mobilenetv20_features_linearbottleneck7_elemwise_add0 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck8_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck8_conv0_fwd 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        mobilenetv20_features_linearbottleneck8_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck8_conv0_fwd mobilenetv20_features_linearbottleneck8_batchnorm0_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck8_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck8_batchnorm0_fwd mobilenetv20_features_linearbottleneck8_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck8_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck8_relu0_fwd mobilenetv20_features_linearbottleneck8_conv1_fwd 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        mobilenetv20_features_linearbottleneck8_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck8_conv1_fwd mobilenetv20_features_linearbottleneck8_batchnorm1_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck8_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck8_batchnorm1_fwd mobilenetv20_features_linearbottleneck8_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck8_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck8_relu1_fwd mobilenetv20_features_linearbottleneck8_conv2_fwd 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        mobilenetv20_features_linearbottleneck8_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck8_conv2_fwd mobilenetv20_features_linearbottleneck8_batchnorm2_fwd 0=64
BinaryOp         mobilenetv20_features_linearbottleneck8_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck8_batchnorm2_fwd mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck8_elemwise_add0 0=0
Split            splitncnn_5              1 2 mobilenetv20_features_linearbottleneck8_elemwise_add0 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck9_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck9_conv0_fwd 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        mobilenetv20_features_linearbottleneck9_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck9_conv0_fwd mobilenetv20_features_linearbottleneck9_batchnorm0_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck9_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck9_batchnorm0_fwd mobilenetv20_features_linearbottleneck9_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck9_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck9_relu0_fwd mobilenetv20_features_linearbottleneck9_conv1_fwd 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        mobilenetv20_features_linearbottleneck9_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck9_conv1_fwd mobilenetv20_features_linearbottleneck9_batchnorm1_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck9_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck9_batchnorm1_fwd mobilenetv20_features_linearbottleneck9_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck9_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck9_relu1_fwd mobilenetv20_features_linearbottleneck9_conv2_fwd 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        mobilenetv20_features_linearbottleneck9_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck9_conv2_fwd mobilenetv20_features_linearbottleneck9_batchnorm2_fwd 0=64
BinaryOp         mobilenetv20_features_linearbottleneck9_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck9_batchnorm2_fwd mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck9_elemwise_add0 0=0
Convolution      mobilenetv20_features_linearbottleneck10_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck9_elemwise_add0 mobilenetv20_features_linearbottleneck10_conv0_fwd 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        mobilenetv20_features_linearbottleneck10_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck10_conv0_fwd mobilenetv20_features_linearbottleneck10_batchnorm0_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck10_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck10_batchnorm0_fwd mobilenetv20_features_linearbottleneck10_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck10_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck10_relu0_fwd mobilenetv20_features_linearbottleneck10_conv1_fwd 0=384 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        mobilenetv20_features_linearbottleneck10_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck10_conv1_fwd mobilenetv20_features_linearbottleneck10_batchnorm1_fwd 0=384
ReLU             mobilenetv20_features_linearbottleneck10_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck10_batchnorm1_fwd mobilenetv20_features_linearbottleneck10_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck10_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck10_relu1_fwd mobilenetv20_features_linearbottleneck10_conv2_fwd 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        mobilenetv20_features_linearbottleneck10_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck10_conv2_fwd mobilenetv20_features_linearbottleneck10_batchnorm2_fwd 0=96
Split            splitncnn_6              1 2 mobilenetv20_features_linearbottleneck10_batchnorm2_fwd mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck11_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck11_conv0_fwd 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        mobilenetv20_features_linearbottleneck11_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck11_conv0_fwd mobilenetv20_features_linearbottleneck11_batchnorm0_fwd 0=576
ReLU             mobilenetv20_features_linearbottleneck11_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck11_batchnorm0_fwd mobilenetv20_features_linearbottleneck11_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck11_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck11_relu0_fwd mobilenetv20_features_linearbottleneck11_conv1_fwd 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        mobilenetv20_features_linearbottleneck11_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck11_conv1_fwd mobilenetv20_features_linearbottleneck11_batchnorm1_fwd 0=576
ReLU             mobilenetv20_features_linearbottleneck11_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck11_batchnorm1_fwd mobilenetv20_features_linearbottleneck11_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck11_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck11_relu1_fwd mobilenetv20_features_linearbottleneck11_conv2_fwd 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        mobilenetv20_features_linearbottleneck11_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck11_conv2_fwd mobilenetv20_features_linearbottleneck11_batchnorm2_fwd 0=96
BinaryOp         mobilenetv20_features_linearbottleneck11_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck11_batchnorm2_fwd mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck11_elemwise_add0 0=0
Split            splitncnn_7              1 2 mobilenetv20_features_linearbottleneck11_elemwise_add0 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck12_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck12_conv0_fwd 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        mobilenetv20_features_linearbottleneck12_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck12_conv0_fwd mobilenetv20_features_linearbottleneck12_batchnorm0_fwd 0=576
ReLU             mobilenetv20_features_linearbottleneck12_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck12_batchnorm0_fwd mobilenetv20_features_linearbottleneck12_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck12_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck12_relu0_fwd mobilenetv20_features_linearbottleneck12_conv1_fwd 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        mobilenetv20_features_linearbottleneck12_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck12_conv1_fwd mobilenetv20_features_linearbottleneck12_batchnorm1_fwd 0=576
ReLU             mobilenetv20_features_linearbottleneck12_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck12_batchnorm1_fwd mobilenetv20_features_linearbottleneck12_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck12_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck12_relu1_fwd mobilenetv20_features_linearbottleneck12_conv2_fwd 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        mobilenetv20_features_linearbottleneck12_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck12_conv2_fwd mobilenetv20_features_linearbottleneck12_batchnorm2_fwd 0=96
BinaryOp         mobilenetv20_features_linearbottleneck12_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck12_batchnorm2_fwd mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck12_elemwise_add0 0=0
Convolution      mobilenetv20_features_linearbottleneck13_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck12_elemwise_add0 mobilenetv20_features_linearbottleneck13_conv0_fwd 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        mobilenetv20_features_linearbottleneck13_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck13_conv0_fwd mobilenetv20_features_linearbottleneck13_batchnorm0_fwd 0=576
ReLU             mobilenetv20_features_linearbottleneck13_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck13_batchnorm0_fwd mobilenetv20_features_linearbottleneck13_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck13_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck13_relu0_fwd mobilenetv20_features_linearbottleneck13_conv1_fwd 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        mobilenetv20_features_linearbottleneck13_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck13_conv1_fwd mobilenetv20_features_linearbottleneck13_batchnorm1_fwd 0=576
ReLU             mobilenetv20_features_linearbottleneck13_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck13_batchnorm1_fwd mobilenetv20_features_linearbottleneck13_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck13_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck13_relu1_fwd mobilenetv20_features_linearbottleneck13_conv2_fwd 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        mobilenetv20_features_linearbottleneck13_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck13_conv2_fwd mobilenetv20_features_linearbottleneck13_batchnorm2_fwd 0=160
Split            splitncnn_8              1 2 mobilenetv20_features_linearbottleneck13_batchnorm2_fwd mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck14_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck14_conv0_fwd 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        mobilenetv20_features_linearbottleneck14_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck14_conv0_fwd mobilenetv20_features_linearbottleneck14_batchnorm0_fwd 0=960
ReLU             mobilenetv20_features_linearbottleneck14_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck14_batchnorm0_fwd mobilenetv20_features_linearbottleneck14_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck14_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck14_relu0_fwd mobilenetv20_features_linearbottleneck14_conv1_fwd 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        mobilenetv20_features_linearbottleneck14_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck14_conv1_fwd mobilenetv20_features_linearbottleneck14_batchnorm1_fwd 0=960
ReLU             mobilenetv20_features_linearbottleneck14_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck14_batchnorm1_fwd mobilenetv20_features_linearbottleneck14_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck14_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck14_relu1_fwd mobilenetv20_features_linearbottleneck14_conv2_fwd 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        mobilenetv20_features_linearbottleneck14_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck14_conv2_fwd mobilenetv20_features_linearbottleneck14_batchnorm2_fwd 0=160
BinaryOp         mobilenetv20_features_linearbottleneck14_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck14_batchnorm2_fwd mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck14_elemwise_add0 0=0
Split            splitncnn_9              1 2 mobilenetv20_features_linearbottleneck14_elemwise_add0 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_1
Convolution      mobilenetv20_features_linearbottleneck15_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck15_conv0_fwd 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        mobilenetv20_features_linearbottleneck15_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck15_conv0_fwd mobilenetv20_features_linearbottleneck15_batchnorm0_fwd 0=960
ReLU             mobilenetv20_features_linearbottleneck15_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck15_batchnorm0_fwd mobilenetv20_features_linearbottleneck15_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck15_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck15_relu0_fwd mobilenetv20_features_linearbottleneck15_conv1_fwd 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        mobilenetv20_features_linearbottleneck15_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck15_conv1_fwd mobilenetv20_features_linearbottleneck15_batchnorm1_fwd 0=960
ReLU             mobilenetv20_features_linearbottleneck15_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck15_batchnorm1_fwd mobilenetv20_features_linearbottleneck15_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck15_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck15_relu1_fwd mobilenetv20_features_linearbottleneck15_conv2_fwd 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        mobilenetv20_features_linearbottleneck15_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck15_conv2_fwd mobilenetv20_features_linearbottleneck15_batchnorm2_fwd 0=160
BinaryOp         mobilenetv20_features_linearbottleneck15_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck15_batchnorm2_fwd mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck15_elemwise_add0 0=0
Convolution      mobilenetv20_features_linearbottleneck16_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck15_elemwise_add0 mobilenetv20_features_linearbottleneck16_conv0_fwd 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        mobilenetv20_features_linearbottleneck16_batchnorm0_fwd 1 1 mobilenetv20_features_linearbottleneck16_conv0_fwd mobilenetv20_features_linearbottleneck16_batchnorm0_fwd 0=960
ReLU             mobilenetv20_features_linearbottleneck16_relu0_fwd 1 1 mobilenetv20_features_linearbottleneck16_batchnorm0_fwd mobilenetv20_features_linearbottleneck16_relu0_fwd
ConvolutionDepthWise mobilenetv20_features_linearbottleneck16_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck16_relu0_fwd mobilenetv20_features_linearbottleneck16_conv1_fwd 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        mobilenetv20_features_linearbottleneck16_batchnorm1_fwd 1 1 mobilenetv20_features_linearbottleneck16_conv1_fwd mobilenetv20_features_linearbottleneck16_batchnorm1_fwd 0=960
ReLU             mobilenetv20_features_linearbottleneck16_relu1_fwd 1 1 mobilenetv20_features_linearbottleneck16_batchnorm1_fwd mobilenetv20_features_linearbottleneck16_relu1_fwd
Convolution      mobilenetv20_features_linearbottleneck16_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck16_relu1_fwd mobilenetv20_features_linearbottleneck16_conv2_fwd 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        mobilenetv20_features_linearbottleneck16_batchnorm2_fwd 1 1 mobilenetv20_features_linearbottleneck16_conv2_fwd mobilenetv20_features_linearbottleneck16_batchnorm2_fwd 0=320
Convolution      mobilenetv20_features_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck16_batchnorm2_fwd mobilenetv20_features_conv1_fwd 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=409600
BatchNorm        mobilenetv20_features_batchnorm1_fwd 1 1 mobilenetv20_features_conv1_fwd mobilenetv20_features_batchnorm1_fwd 0=1280
ReLU             mobilenetv20_features_relu1_fwd 1 1 mobilenetv20_features_batchnorm1_fwd mobilenetv20_features_relu1_fwd
Pooling          mobilenetv20_features_pool0_fwd 1 1 mobilenetv20_features_relu1_fwd mobilenetv20_features_pool0_fwd 0=1 4=1
Convolution      mobilenetv20_output_pred_fwd 1 1 mobilenetv20_features_pool0_fwd mobilenetv20_output_pred_fwd 0=1000 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1280000
Reshape          mobilenetv20_output_flatten0_reshape0 1 1 mobilenetv20_output_pred_fwd mobilenetv20_output_flatten0_reshape0 0=-1
